Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.h
  #if (RTE_SPI2_MISO == 1)
    #if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F446xx)
      // PI2 as SPI2 MISO not available on STM32F401xx, STM32F411xx and STM32F446xx
      #if (RTE_SPI2_MISO_PORT_ID == 3)
        #error "PI2 can not be configured as SPI2 MISO on selected device!"
      #endif
    #elif defined (STM32F410Cx)
      // SPI2 MISO available on pin: PB14
      #if (RTE_SPI2_MISO_PORT_ID != 1)
        #error "Only PB14 can be configured as SPI2 MISO on selected device!"
      #endif
    #elif defined (STM32F410Rx)
      // SPI2 MISO available on pins: PB14, PC2
      #if ((RTE_SPI2_MISO_PORT_ID != 1) && (RTE_SPI2_MISO_PORT_ID != 2))
        #error "Only PB14 and PC2 can be configured as SPI2 MISO on selected device!"
      #endif
    #elif defined (STM32F413xx) || defined (STM32F423xx)
      // SPI2 MISO available on pins: PB14, PC2, PA12
      #if ((RTE_SPI2_MISO_PORT_ID != 1) && (RTE_SPI2_MISO_PORT_ID != 2) && (RTE_SPI2_MISO_PORT_ID != 4))
        #error "Only PB14, PC2, PA12 can be configured as SPI2 MISO on selected device!"
      #endif
    #endif

    #define MX_SPI2_MISO_Pin        1U
    #define MX_SPI2_MISO_GPIOx      RTE_SPI2_MISO_PORT
    #define MX_SPI2_MISO_GPIO_Pin   (1U << RTE_SPI2_MISO_BIT)
    #define MX_SPI2_MISO_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI2_MISO_GPIO_Speed SPI2_GPIO_SPEED_FREQ
    #define MX_SPI2_MISO_GPIO_AF    GPIO_AF5_SPI2
  #endif

  #if (RTE_SPI2_MOSI == 1)
    #if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F446xx)
      // PI3 as SPI2 MOSI not available on STM32F401xx, STM32F411xx and STM32F446xx
      #if (RTE_SPI2_MOSI_PORT_ID == 3)
        #error "PI3 can not be configured as SPI2 MOSI on selected device!"
      #endif
    #elif defined (STM32F410Cx)
      // SPI2 MOSI available on pin: PB15
      #if (RTE_SPI2_MOSI_PORT_ID != 1)
        #error "Only PB15 can be configured as SPI2 MOSI on selected device!"
      #endif
    #elif defined (STM32F410Rx)
      // SPI2 MOSI available on pins: PB15, PC3
      #if ((RTE_SPI2_MOSI_PORT_ID != 1) && (RTE_SPI2_MOSI_PORT_ID != 2))
        #error "Only PB15 and PC3 can be configured as SPI2 MOSI on selected device!"
      #endif
    #elif defined (STM32F413xx) || defined (STM32F423xx)
      // SPI2 MOSI available on pins: PB15, PC3, PA10
      #if ((RTE_SPI2_MOSI_PORT_ID != 1) && (RTE_SPI2_MOSI_PORT_ID != 2) && (RTE_SPI2_MOSI_PORT_ID != 4))
        #error "Only PB15, PC3, PA10 can be configured as SPI2 MOSI on selected device!"
      #endif
    #endif

    #define MX_SPI2_MOSI_Pin        1U
    #define MX_SPI2_MOSI_GPIOx      RTE_SPI2_MOSI_PORT
    #define MX_SPI2_MOSI_GPIO_Pin   (1U << RTE_SPI2_MOSI_BIT)
    #define MX_SPI2_MOSI_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI2_MOSI_GPIO_Speed SPI2_GPIO_SPEED_FREQ
    #define MX_SPI2_MOSI_GPIO_AF    GPIO_AF5_SPI2
  #endif

  #if defined (STM32F410Cx)
    // SPI2 SCK available on pins: PB10, PB13
    #if (RTE_SPI2_SCL_PORT_ID > 1)
      #error "Only PB10 and PB13 can be configured as SPI2 SCK on selected device!"
    #endif
  #elif defined (STM32F410Rx)
    // SPI2 SCK available on pins: PB10, PB13, PC7
    #if (RTE_SPI2_SCL_PORT_ID > 2)
      #error "Only PB10, PB13 and PC7 can be configured as SPI2 SCK on selected device!"
    #endif
  #elif !defined(STM32F411xE) && !defined(STM32F446xx)
    // PC7 as SPI2 SCK only available on STM32F411xx and STM32F446xx
    #if (RTE_SPI2_SCL_PORT_ID == 2)
      #error "PC7 can not be configured as SPI2 SCK on selected device!"
    #endif
  #elif defined(STM32F405xx) || defined(STM32F407xx) || defined(STM32F415xx) || defined(STM32F417xx)
    // PD3 as SPI2 SCK not available on STM32F405xx, STM32F407xx, STM32F415xx and STM32F417xx
    #if (RTE_SPI2_SCL_PORT_ID == 3)
      #error "PD3 can not be configured as SPI2 SCK on selected device!"
    #endif
  #elif defined(STM32F446xx)
    // PI1 as SPI2 SCK not available on STM32F446xx
    #if (RTE_SPI2_SCL_PORT_ID == 1)
      #error "PI1 can not be configured as SPI2 SCK on selected device!"
    #endif
  #elif defined (STM32F413xx) || defined (STM32F423xx)
    // PI1 as SPI2 SCK not available on STM32F413xx, STM32F423xx
    #if (RTE_SPI2_SCL_PORT_ID == 4)
      #error "PI1 can not be configured as SPI2 SCK on selected device!"
    #endif
  #endif

  #define MX_SPI2_SCK_Pin        1U
  #define MX_SPI2_SCK_GPIOx      RTE_SPI2_SCL_PORT
  #define MX_SPI2_SCK_GPIO_Pin   (1U << RTE_SPI2_SCL_BIT)
  #define MX_SPI2_SCK_GPIO_PuPd  GPIO_NOPULL
  #define MX_SPI2_SCK_GPIO_Speed SPI2_GPIO_SPEED_FREQ
  #define MX_SPI2_SCK_GPIO_AF    GPIO_AF5_SPI2

  #if (RTE_SPI2_NSS_PIN == 1)
    #if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE) || defined(STM32F446xx)
      // PI0 as SPI2 NSS not available on STM32F401xx, STM32F411xx and STM32F446xx
      #if (RTE_SPI2_NSS_PORT_ID == 3)
        #error "PI0 can not be configured as SPI2 NSS on selected device!"
      #endif
    #elif defined (STM32F410Cx) || defined (STM32F410Rx)
      // SPI2 NSS available on pins: PB9, PB12
      #if (RTE_SPI2_NSS_PORT_ID > 2)
        #error "Only PB9 and PB12 can be configured as SPI2 NSS on selected device!"
      #endif
    #elif defined (STM32F413xx) || defined (STM32F423xx)
      // PI0 as SPI2 NSS not available on STM32F413xx, STM32F423xx
      #if (RTE_SPI2_NSS_PORT_ID == 3)
        #error "PI0 can not be configured as SPI2 NSS on selected device!"
      #endif
    #endif

    #define MX_SPI2_NSS_Pin        1U
    #define MX_SPI2_NSS_GPIOx      RTE_SPI2_NSS_PORT
    #define MX_SPI2_NSS_GPIO_Pin  (1U << RTE_SPI2_NSS_BIT)
    #define MX_SPI2_NSS_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI2_NSS_GPIO_Speed SPI2_GPIO_SPEED_FREQ
    #define MX_SPI2_NSS_GPIO_AF    GPIO_AF5_SPI2
  #endif
#endif

// SPI3 configuration definitions
#if (RTE_SPI3 == 1)

  #ifndef SPI3
    #error "SPI3 not available for selected device!"
  #endif

  #define MX_SPI3

  #if (RTE_SPI3_RX_DMA == 1)
    #define MX_SPI3_RX_DMA_Instance DMAx_STREAMy(RTE_SPI3_RX_DMA_NUMBER, RTE_SPI3_RX_DMA_STREAM)
    #define MX_SPI3_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_SPI3_RX_DMA_NUMBER, RTE_SPI3_RX_DMA_STREAM)
    #define MX_SPI3_RX_DMA_Channel  DMA_CHANNEL_x(RTE_SPI3_RX_DMA_CHANNEL)
    #define MX_SPI3_RX_DMA_Priority DMA_PRIORITY(RTE_SPI3_RX_DMA_PRIORITY)

    #define SPI3_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_SPI3_RX_DMA_NUMBER, RTE_SPI3_RX_DMA_STREAM)
  #endif
  #if (RTE_SPI3_TX_DMA == 1)
    #define MX_SPI3_TX_DMA_Instance DMAx_STREAMy(RTE_SPI3_TX_DMA_NUMBER, RTE_SPI3_TX_DMA_STREAM)
    #define MX_SPI3_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_SPI3_TX_DMA_NUMBER, RTE_SPI3_TX_DMA_STREAM)
    #define MX_SPI3_TX_DMA_Channel  DMA_CHANNEL_x(RTE_SPI3_TX_DMA_CHANNEL)
    #define MX_SPI3_TX_DMA_Priority DMA_PRIORITY(RTE_SPI3_TX_DMA_PRIORITY)

    #define SPI3_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_SPI3_TX_DMA_NUMBER, RTE_SPI3_TX_DMA_STREAM)
  #endif

