Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.h
  #ifndef SPI3_GPIO_SPEED_FREQ
    #define SPI3_GPIO_SPEED_FREQ  GPIO_SPEED_FREQ_HIGH
  #endif

  #if (RTE_SPI3_MISO == 1)
    #define MX_SPI3_MISO_Pin        1U
    #define MX_SPI3_MISO_GPIOx      RTE_SPI3_MISO_PORT
    #define MX_SPI3_MISO_GPIO_Pin   (1U << RTE_SPI3_MISO_BIT)
    #define MX_SPI3_MISO_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI3_MISO_GPIO_Speed SPI3_GPIO_SPEED_FREQ
    #define MX_SPI3_MISO_GPIO_AF    GPIO_AF6_SPI3
  #endif

  #if (RTE_SPI3_MOSI == 1)
    #if defined(STM32F405xx) || defined(STM32F407xx) || \
        defined(STM32F415xx) || defined(STM32F417xx)
      // PD6 as SPI3 MOSI not available on STM32F405xx, STM32F407xx, STM32F415xx and STM32F417xx
      #if (RTE_SPI3_MOSI_PORT_ID == 3)
        #error "PD6 can not be configured as SPI3 MOSI on selected device!"
      #endif
    #endif
    #define MX_SPI3_MOSI_Pin        1U
    #define MX_SPI3_MOSI_GPIOx      RTE_SPI3_MOSI_PORT
    #define MX_SPI3_MOSI_GPIO_Pin   (1U << RTE_SPI3_MOSI_BIT)
    #define MX_SPI3_MOSI_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI3_MOSI_GPIO_Speed SPI3_GPIO_SPEED_FREQ

    #if (defined (STM32F413xx) || defined (STM32F423xx)) && (RTE_SPI3_MOSI_PORT_ID == 3)
    #define MX_SPI3_MOSI_GPIO_AF    GPIO_AF5_SPI3
    #else
    #define MX_SPI3_MOSI_GPIO_AF    GPIO_AF6_SPI3
    #endif
  #endif

  #if !defined(STM32F411xE) && !defined(STM32F412Cx) && !defined(STM32F412Rx) && !defined(STM32F412Vx) && !defined(STM32F412Zx) && !defined(STM32F413xx) && !defined(STM32F423xx)
    // PB12 as SPI3 SCK not available on STM32F411xx, STM32F412xx, STM32F413xx and STM32F423xx
    #if (RTE_SPI3_SCL_PORT_ID == 1)
      #error "PB12 can not be configured as SPI3 SCK on selected device!"
    #endif
  #endif
  #define MX_SPI3_SCK_Pin        1U
  #define MX_SPI3_SCK_GPIOx      RTE_SPI3_SCL_PORT
  #define MX_SPI3_SCK_GPIO_Pin  (1U << RTE_SPI3_SCL_BIT)
  #define MX_SPI3_SCK_GPIO_PuPd  GPIO_NOPULL
  #define MX_SPI3_SCK_GPIO_Speed SPI3_GPIO_SPEED_FREQ

  #if (defined (STM32F413xx) || defined (STM32F423xx)) && (RTE_SPI3_SCL_PORT_ID == 1)
  #define MX_SPI3_SCK_GPIO_AF    GPIO_AF7_SPI3
  #else
  #define MX_SPI3_SCK_GPIO_AF    GPIO_AF6_SPI3
  #endif

  #if (RTE_SPI3_NSS_PIN == 1)
    #define MX_SPI3_NSS_Pin         1U
    #define MX_SPI3_NSS_GPIOx       RTE_SPI3_NSS_PORT
    #define MX_SPI3_NSS_GPIO_Pin   (1U << RTE_SPI3_NSS_BIT)
    #define MX_SPI3_NSS_GPIO_PuPd   GPIO_NOPULL
    #define MX_SPI3_NSS_GPIO_Speed  SPI3_GPIO_SPEED_FREQ
    #define MX_SPI3_NSS_GPIO_AF     GPIO_AF6_SPI3
  #endif
#endif

// SPI4 configuration definitions
#if (RTE_SPI4 == 1)

  #ifndef SPI4
    #error "SPI4 not available for selected device!"
  #endif
  
  #define MX_SPI4

  #if (RTE_SPI4_RX_DMA == 1)
    #define MX_SPI4_RX_DMA_Instance DMAx_STREAMy(RTE_SPI4_RX_DMA_NUMBER, RTE_SPI4_RX_DMA_STREAM)
    #define MX_SPI4_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_SPI4_RX_DMA_NUMBER, RTE_SPI4_RX_DMA_STREAM)
    #define MX_SPI4_RX_DMA_Channel  DMA_CHANNEL_x(RTE_SPI4_RX_DMA_CHANNEL)
    #define MX_SPI4_RX_DMA_Priority DMA_PRIORITY(RTE_SPI4_RX_DMA_PRIORITY)

    #define SPI4_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_SPI4_RX_DMA_NUMBER, RTE_SPI4_RX_DMA_STREAM)
  #endif
  #if (RTE_SPI4_TX_DMA == 1)
    #define MX_SPI4_TX_DMA_Instance DMAx_STREAMy(RTE_SPI4_TX_DMA_NUMBER, RTE_SPI4_TX_DMA_STREAM)
    #define MX_SPI4_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_SPI4_TX_DMA_NUMBER, RTE_SPI4_TX_DMA_STREAM)
    #define MX_SPI4_TX_DMA_Channel  DMA_CHANNEL_x(RTE_SPI4_TX_DMA_CHANNEL)
    #define MX_SPI4_TX_DMA_Priority DMA_PRIORITY(RTE_SPI4_TX_DMA_PRIORITY)

    #define SPI4_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_SPI4_TX_DMA_NUMBER, RTE_SPI4_TX_DMA_STREAM)
  #endif

  #ifndef SPI4_GPIO_SPEED_FREQ
    #define SPI4_GPIO_SPEED_FREQ  GPIO_SPEED_FREQ_HIGH
  #endif

  #if (RTE_SPI4_MISO == 1)
    #ifndef STM32F411xE
      // PA11 as SPI4 MISO only available on STM32F411xx
      #if (RTE_SPI4_MISO_PORT_ID == 1)
        #error "PA11 can not be configured as SPI4 MISO on selected device!"
      #endif
    #endif
    #define MX_SPI4_MISO_Pin        1U
    #define MX_SPI4_MISO_GPIOx      RTE_SPI4_MISO_PORT
    #define MX_SPI4_MISO_GPIO_Pin   (1U << RTE_SPI4_MISO_BIT)
    #define MX_SPI4_MISO_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI4_MISO_GPIO_Speed SPI4_GPIO_SPEED_FREQ

    #if (defined (STM32F413xx) || defined (STM32F423xx)) && (RTE_SPI4_MISO_PORT_ID == 1)
    #define MX_SPI4_MISO_GPIO_AF   GPIO_AF6_SPI4
    #else
    #define MX_SPI4_MISO_GPIO_AF   GPIO_AF5_SPI4
    #endif
  #endif

  #if (RTE_SPI4_MOSI == 1)
    #ifndef STM32F411xE
      // PA1 as SPI4 MOSI only available on STM32F411xx
      #if (RTE_SPI4_MOSI_PORT_ID == 1)
        #error "PA1 can not be configured as SPI4 MOSI on selected device!"
      #endif
    #endif
    #define MX_SPI4_MOSI_Pin        1U
    #define MX_SPI4_MOSI_GPIOx      RTE_SPI4_MOSI_PORT
    #define MX_SPI4_MOSI_GPIO_Pin   (1U << RTE_SPI4_MOSI_BIT)
    #define MX_SPI4_MOSI_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI4_MOSI_GPIO_Speed SPI4_GPIO_SPEED_FREQ
    #define MX_SPI4_MOSI_GPIO_AF    GPIO_AF5_SPI4
  #endif

  #ifndef STM32F411xE
    // PB13 as SPI4 SCK only available on STM32F411xx
    #if (RTE_SPI4_SCL_PORT_ID == 0)
      #error "PB13 can not be configured as SPI4 SCK on selected device!"
    #endif
  #endif
  #define MX_SPI4_SCK_Pin        1U
  #define MX_SPI4_SCK_GPIOx      RTE_SPI4_SCL_PORT
  #define MX_SPI4_SCK_GPIO_Pin   (1U << RTE_SPI4_SCL_BIT)
  #define MX_SPI4_SCK_GPIO_PuPd  GPIO_NOPULL
  #define MX_SPI4_SCK_GPIO_Speed SPI4_GPIO_SPEED_FREQ

  #if (defined (STM32F413xx) || defined (STM32F423xx)) && (RTE_SPI4_SCL_PORT_ID == 0)
  #define MX_SPI4_SCK_GPIO_AF   GPIO_AF6_SPI4
  #else
  #define MX_SPI4_SCK_GPIO_AF   GPIO_AF5_SPI4
  #endif

  #if (RTE_SPI4_NSS_PIN == 1)
    #ifndef STM32F411xE
      // PB12 as SPI4 NSS only available on STM32F411xx
      #if (RTE_SPI4_NSS_PORT_ID == 1)
        #error "PB12 can not be configured as SPI4 NSS on selected device!"
      #endif
    #endif
    #define MX_SPI4_NSS_Pin        1U
    #define MX_SPI4_NSS_GPIOx      RTE_SPI4_NSS_PORT
    #define MX_SPI4_NSS_GPIO_Pin  (1U << RTE_SPI4_NSS_BIT)
    #define MX_SPI4_NSS_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI4_NSS_GPIO_Speed SPI4_GPIO_SPEED_FREQ

    #if (defined (STM32F413xx) || defined (STM32F423xx)) && (RTE_SPI4_NSS_PORT_ID == 1)
    #define MX_SPI4_NSS_GPIO_AF    GPIO_AF6_SPI4
    #else
    #define MX_SPI4_NSS_GPIO_AF    GPIO_AF5_SPI4
    #endif
  #endif
#endif

