Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.h
// SPI5 configuration definitions
#if (RTE_SPI5 == 1)

  #ifndef SPI5
    #error "SPI5 not available for selected device!"
  #endif

  #define MX_SPI5

  #if (RTE_SPI5_RX_DMA == 1)
    #define MX_SPI5_RX_DMA_Instance DMAx_STREAMy(RTE_SPI5_RX_DMA_NUMBER, RTE_SPI5_RX_DMA_STREAM)
    #define MX_SPI5_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_SPI5_RX_DMA_NUMBER, RTE_SPI5_RX_DMA_STREAM)
    #define MX_SPI5_RX_DMA_Channel  DMA_CHANNEL_x(RTE_SPI5_RX_DMA_CHANNEL)
    #define MX_SPI5_RX_DMA_Priority DMA_PRIORITY(RTE_SPI5_RX_DMA_PRIORITY)

    #define SPI5_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_SPI5_RX_DMA_NUMBER, RTE_SPI5_RX_DMA_STREAM)
  #endif
  #if (RTE_SPI5_TX_DMA == 1)
    #define MX_SPI5_TX_DMA_Instance DMAx_STREAMy(RTE_SPI5_TX_DMA_NUMBER, RTE_SPI5_TX_DMA_STREAM)
    #define MX_SPI5_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_SPI5_TX_DMA_NUMBER, RTE_SPI5_TX_DMA_STREAM)
    #define MX_SPI5_TX_DMA_Channel  DMA_CHANNEL_x(RTE_SPI5_TX_DMA_CHANNEL)
    #define MX_SPI5_TX_DMA_Priority DMA_PRIORITY(RTE_SPI5_TX_DMA_PRIORITY)

    #define SPI5_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_SPI5_TX_DMA_NUMBER, RTE_SPI5_TX_DMA_STREAM)
  #endif

  #ifndef SPI5_GPIO_SPEED_FREQ
    #define SPI5_GPIO_SPEED_FREQ  GPIO_SPEED_FREQ_HIGH
  #endif

  #if (RTE_SPI5_MISO == 1)
    #if defined (STM32F410Cx) || defined (STM32F410Rx)
      // SPI5 MISO available on pin: PA12
      #if (RTE_SPI5_MISO_PORT_ID != 1)
        #error "Only PA12 can be configured as SPI5 MISO on selected device!"
      #endif
    #elif !defined (STM32F411xE)
      // PA12 as SPI5 MISO only available on STM32F411xx
      #if (RTE_SPI5_MISO_PORT_ID == 1)
        #error "PA12 can not be configured as SPI5 MISO on selected device!"
      #endif
 
      // PE5 as SPI5 MISO only available on STM32F411xx
      #if (RTE_SPI5_MISO_PORT_ID == 2)
        #error "PE5 can not be configured as SPI5 MISO on selected device!"
      #endif

      // PE13 as SPI5 MISO only available on STM32F411xx
      #if (RTE_SPI5_MISO_PORT_ID == 3)
        #error "PE13 can not be configured as SPI5 MISO on selected device!"
      #endif
    #else
      // PF8 as SPI5 MISO only available on STM32F427xx, STM32F429xx, STM32F437xx and STM32F439xx
      #if (RTE_SPI5_MISO_PORT_ID == 4)
        #error "PF8 can not be configured as SPI5 MISO on selected device!"
      #endif

      // PH7 as SPI5 MISO only available on STM32F427xx, STM32F429xx, STM32F437xx and STM32F439xx
      #if (RTE_SPI5_MISO_PORT_ID == 5)
        #error "PH7 can not be configured as SPI5 MISO on selected device!"
      #endif
    #endif
    #define MX_SPI5_MISO_Pin        1U
    #define MX_SPI5_MISO_GPIOx      RTE_SPI5_MISO_PORT
    #define MX_SPI5_MISO_GPIO_Pin   (1U << RTE_SPI5_MISO_BIT)
    #define MX_SPI5_MISO_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI5_MISO_GPIO_Speed SPI5_GPIO_SPEED_FREQ

    #if defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || \
        defined(STM32F413xx) || defined(STM32F423xx)
    #define MX_SPI5_MISO_GPIO_AF   GPIO_AF6_SPI5
    #else
    #define MX_SPI5_MISO_GPIO_AF   GPIO_AF5_SPI5
    #endif
  #endif

  #if (RTE_SPI5_MOSI == 1)
    #if defined (STM32F410Cx) || defined (STM32F410Rx)
      // SPI5 MOSI available on pins: PA10, PB8
      #if ((RTE_SPI5_MOSI_PORT_ID != 1) && (RTE_SPI5_MOSI_PORT_ID != 2))
        #error "Only PA10 and PB8 can be configured as SPI5 MOSI on selected device!"
      #endif
    #elif !defined (STM32F411xE)
      // PA10 as SPI5 MOSI only available on STM32F411xx
      #if (RTE_SPI5_MOSI_PORT_ID == 1)
        #error "PA10 can not be configured as SPI5 MOSI on selected device!"
      #endif
 
      // PB8 as SPI5 MOSI only available on STM32F411xx
      #if (RTE_SPI5_MOSI_PORT_ID == 2)
        #error "PB8 can not be configured as SPI5 MOSI on selected device!"
      #endif

      // PE6 as SPI5 MOSI only available on STM32F411xx
      #if (RTE_SPI5_MOSI_PORT_ID == 3)
        #error "PE6 can not be configured as SPI5 MOSI on selected device!"
      #endif

      // PE14 as SPI5 MOSI only available on STM32F411xx
      #if (RTE_SPI5_MOSI_PORT_ID == 4)
        #error "PE14 can not be configured as SPI5 MOSI on selected device!"
      #endif
    #else
      // PF9 as SPI5 MOSI only available on STM32F427xx, STM32F429xx, STM32F437xx and STM32F439xx
      #if (RTE_SPI5_MOSI_PORT_ID == 5)
        #error "PF9 can not be configured as SPI5 MOSI on selected device!"
      #endif

      // PF11 as SPI5 MOSI only available on STM32F427xx, STM32F429xx, STM32F437xx and STM32F439xx
      #if (RTE_SPI5_MOSI_PORT_ID == 6)
        #error "PF11 can not be configured as SPI5 MOSI on selected device!"
      #endif
    #endif
    #define MX_SPI5_MOSI_Pin        1U
    #define MX_SPI5_MOSI_GPIOx      RTE_SPI5_MOSI_PORT
    #define MX_SPI5_MOSI_GPIO_Pin   (1U << RTE_SPI5_MOSI_BIT)
    #define MX_SPI5_MOSI_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI5_MOSI_GPIO_Speed SPI5_GPIO_SPEED_FREQ

    #if defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || \
        defined(STM32F413xx) || defined(STM32F423xx)
    #define MX_SPI5_MOSI_GPIO_AF   GPIO_AF6_SPI5
    #else
    #define MX_SPI5_MOSI_GPIO_AF   GPIO_AF5_SPI5
    #endif
  #endif

  #if defined (STM32F410Cx) || defined (STM32F410Rx)
    // SPI5 SCK available on pin: PB0
    #if (RTE_SPI5_SCL_PORT_ID != 0)
      #error "Only PB0 can be configured as SPI5 SCK on selected device!"
    #endif
  #elif !defined (STM32F411xE)
    // PB0 as SPI5 SCK only available on STM32F411xx
    #if (RTE_SPI5_SCL_PORT_ID == 0)
      #error "PB0 can not be configured as SPI5 SCK on selected device!"
    #endif
 
    // PE2 as SPI5 SCK only available on STM32F411xx
    #if (RTE_SPI5_SCL_PORT_ID == 1)
      #error "PE2 can not be configured as SPI5 SCK on selected device!"
    #endif

    // PE12 as SPI5 SCK only available on STM32F411xx
    #if (RTE_SPI5_SCL_PORT_ID == 2)
      #error "PE12 can not be configured as SPI5 SCK on selected device!"
    #endif
  #else
    // PF7 as SPI5 SCK only available on STM32F427xx, STM32F429xx, STM32F437xx and STM32F439xx
    #if (RTE_SPI5_SCL_PORT_ID == 3)
      #error "PF7 can not be configured as SPI5 SCK on selected device!"
    #endif

    // PH6 as SPI5 SCK only available on STM32F427xx, STM32F429xx, STM32F437xx and STM32F439xx
    #if (RTE_SPI5_SCL_PORT_ID == 4)
      #error "PH6 can not be configured as SPI5 SCK on selected device!"
    #endif
  #endif
  #define MX_SPI5_SCK_Pin        1U
  #define MX_SPI5_SCK_GPIOx      RTE_SPI5_SCL_PORT
  #define MX_SPI5_SCK_GPIO_Pin   (1U << RTE_SPI5_SCL_BIT)
  #define MX_SPI5_SCK_GPIO_PuPd  GPIO_NOPULL
  #define MX_SPI5_SCK_GPIO_Speed SPI5_GPIO_SPEED_FREQ

  #if defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || \
      defined(STM32F413xx) || defined(STM32F423xx)
  #define MX_SPI5_SCK_GPIO_AF   GPIO_AF6_SPI5
  #else
  #define MX_SPI5_SCK_GPIO_AF   GPIO_AF5_SPI5
  #endif


  #if (RTE_SPI5_NSS_PIN == 1)
    #if defined (STM32F410Cx) || defined (STM32F410Rx)
      // SPI5 NSS available on pin: PB1
      #if ((RTE_SPI5_NSS_PORT_ID != 0) && (RTE_SPI5_NSS_PORT_ID != 1))
        #error "Only PB1 can be configured as SPI5 NSS on selected device!"
      #endif
    #elif !defined (STM32F411xE)
      // PB1 as SPI5 NSS only available on STM32F411xx
      #if (RTE_SPI5_NSS_PORT_ID == 0)
        #error "PB1 can not be configured as SPI5 NSS on selected device!"
      #endif
 
