Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.h
      // PE4 as SPI5 NSS only available on STM32F411xx
      #if (RTE_SPI5_NSS_PORT_ID == 1)
        #error "PE4 can not be configured as SPI5 NSS on selected device!"
      #endif

      // PE11 as SPI5 NSS only available on STM32F411xx
      #if (RTE_SPI5_NSS_PORT_ID == 2)
        #error "PE11 can not be configured as SPI5 NSS on selected device!"
      #endif
    #else
      // PF6 as SPI5 NSS only available on STM32F427xx, STM32F429xx, STM32F437xx and STM32F439xx
      #if (RTE_SPI5_NSS_PORT_ID == 3)
        #error "PF6 can not be configured as SPI5 NSS on selected device!"
      #endif

      // PH5 as SPI5 NSS only available on STM32F427xx, STM32F429xx, STM32F437xx and STM32F439xx
      #if (RTE_SPI5_NSS_PORT_ID == 4)
        #error "PH5 can not be configured as SPI5 NSS on selected device!"
      #endif
    #endif
    #define MX_SPI5_NSS_Pin        1U
    #define MX_SPI5_NSS_GPIOx      RTE_SPI5_NSS_PORT
    #define MX_SPI5_NSS_GPIO_Pin  (1U << RTE_SPI5_NSS_BIT)
    #define MX_SPI5_NSS_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI5_NSS_GPIO_Speed SPI5_GPIO_SPEED_FREQ

    #if defined(STM32F413xx) || defined(STM32F423xx)
    #define MX_SPI5_NSS_GPIO_AF    GPIO_AF6_SPI5
    #else
    #define MX_SPI5_NSS_GPIO_AF    GPIO_AF5_SPI5
    #endif
  #endif
#endif

// SPI6 configuration definitions
#if (defined (STM32F413xx) && defined (STM32F423xx)) && defined (SPI6)
  // SPI6 not available
  #undef SPI6
#endif

#if (RTE_SPI6 == 1)

  #ifndef SPI6
    #error "SPI6 not available for selected device!"
  #endif

  #define MX_SPI6

  #if (RTE_SPI6_RX_DMA == 1)
    #define MX_SPI6_RX_DMA_Instance DMAx_STREAMy(RTE_SPI6_RX_DMA_NUMBER, RTE_SPI6_RX_DMA_STREAM)
    #define MX_SPI6_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_SPI6_RX_DMA_NUMBER, RTE_SPI6_RX_DMA_STREAM)
    #define MX_SPI6_RX_DMA_Channel  DMA_CHANNEL_x(RTE_SPI6_RX_DMA_CHANNEL)
    #define MX_SPI6_RX_DMA_Priority DMA_PRIORITY(RTE_SPI6_RX_DMA_PRIORITY)

    #define SPI6_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_SPI6_RX_DMA_NUMBER, RTE_SPI6_RX_DMA_STREAM)
  #endif
  #if (RTE_SPI6_TX_DMA == 1)
    #define MX_SPI6_TX_DMA_Instance DMAx_STREAMy(RTE_SPI6_TX_DMA_NUMBER, RTE_SPI6_TX_DMA_STREAM)
    #define MX_SPI6_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_SPI6_TX_DMA_NUMBER, RTE_SPI6_TX_DMA_STREAM)
    #define MX_SPI6_TX_DMA_Channel  DMA_CHANNEL_x(RTE_SPI6_TX_DMA_CHANNEL)
    #define MX_SPI6_TX_DMA_Priority DMA_PRIORITY(RTE_SPI6_TX_DMA_PRIORITY)

    #define SPI6_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_SPI6_TX_DMA_NUMBER, RTE_SPI6_TX_DMA_STREAM)
  #endif

  #ifndef SPI6_GPIO_SPEED_FREQ
    #define SPI6_GPIO_SPEED_FREQ  GPIO_SPEED_FREQ_HIGH
  #endif

  #define MX_SPI6_SCK_Pin        1U
  #define MX_SPI6_SCK_GPIOx      RTE_SPI6_SCL_PORT
  #define MX_SPI6_SCK_GPIO_Pin   (1U << RTE_SPI6_SCL_BIT)
  #define MX_SPI6_SCK_GPIO_PuPd  GPIO_NOPULL
  #define MX_SPI6_SCK_GPIO_Speed SPI6_GPIO_SPEED_FREQ
  #define MX_SPI6_SCK_GPIO_AF    GPIO_AF5_SPI6

  #if (RTE_SPI6_MISO == 1U)
    #define MX_SPI6_MISO_Pin        1U
    #define MX_SPI6_MISO_GPIOx      RTE_SPI6_MISO_PORT
    #define MX_SPI6_MISO_GPIO_Pin   (1U << RTE_SPI6_MISO_BIT)
    #define MX_SPI6_MISO_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI6_MISO_GPIO_Speed SPI6_GPIO_SPEED_FREQ
    #define MX_SPI6_MISO_GPIO_AF    GPIO_AF5_SPI6
  #endif

  #if (RTE_SPI6_MOSI == 1U)
    #define MX_SPI6_MOSI_Pin        1U
    #define MX_SPI6_MOSI_GPIOx      RTE_SPI6_MOSI_PORT
    #define MX_SPI6_MOSI_GPIO_Pin   (1U << RTE_SPI6_MOSI_BIT)
    #define MX_SPI6_MOSI_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI6_MOSI_GPIO_Speed SPI6_GPIO_SPEED_FREQ
    #define MX_SPI6_MOSI_GPIO_AF    GPIO_AF5_SPI6
  #endif

  #if (RTE_SPI6_NSS_PIN == 1U)
    #define MX_SPI6_NSS_Pin        1U
    #define MX_SPI6_NSS_GPIOx      RTE_SPI6_NSS_PORT
    #define MX_SPI6_NSS_GPIO_Pin  (1U << RTE_SPI6_NSS_BIT)
    #define MX_SPI6_NSS_GPIO_PuPd  GPIO_NOPULL
    #define MX_SPI6_NSS_GPIO_Speed SPI6_GPIO_SPEED_FREQ
    #define MX_SPI6_NSS_GPIO_AF    GPIO_AF5_SPI6
  #endif
#endif

#endif /* RTE_DEVICE_FRAMEWORK_CLASSIC */

#if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
  #if ((defined(RTE_Drivers_SPI1) || \
        defined(RTE_Drivers_SPI2) || \
        defined(RTE_Drivers_SPI3) || \
        defined(RTE_Drivers_SPI4) || \
        defined(RTE_Drivers_SPI5) || \
        defined(RTE_Drivers_SPI6))   \
        && (!defined (MX_SPI1))      \
        && (!defined (MX_SPI2))      \
        && (!defined (MX_SPI3))      \
        && (!defined (MX_SPI4))      \
        && (!defined (MX_SPI5))      \
        && (!defined (MX_SPI6)))
    #error "SPI not configured in STM32CubeMX!"
  #endif

#endif /* RTE_DEVICE_FRAMEWORK_CUBE_MX */


#ifdef MX_SPI1
#if (defined(MX_SPI1_RX_DMA_Instance) || defined(MX_SPI1_TX_DMA_Instance))
#ifndef MX_SPI1_RX_DMA_Instance
  #error "SPI1 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#ifndef MX_SPI1_TX_DMA_Instance
  #error "SPI1 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#endif
#endif

#ifdef MX_SPI2
#if (defined(MX_SPI2_RX_DMA_Instance) || defined(MX_SPI2_TX_DMA_Instance))
#ifndef MX_SPI2_RX_DMA_Instance
  #error "SPI2 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#ifndef MX_SPI2_TX_DMA_Instance
  #error "SPI2 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#endif
#endif

#ifdef MX_SPI3
#if (defined(MX_SPI3_RX_DMA_Instance) || defined(MX_SPI3_TX_DMA_Instance))
#ifndef MX_SPI3_RX_DMA_Instance
  #error "SPI3 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#ifndef MX_SPI3_TX_DMA_Instance
  #error "SPI3 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#endif
#endif

#ifdef MX_SPI4
#if (defined(MX_SPI4_RX_DMA_Instance) || defined(MX_SPI4_TX_DMA_Instance))
#ifndef MX_SPI4_RX_DMA_Instance
  #error "SPI4 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#ifndef MX_SPI4_TX_DMA_Instance
  #error "SPI4 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#endif
#endif

#ifdef MX_SPI5
#if (defined(MX_SPI5_RX_DMA_Instance) || defined(MX_SPI5_TX_DMA_Instance))
#ifndef MX_SPI5_RX_DMA_Instance
  #error "SPI5 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#ifndef MX_SPI5_TX_DMA_Instance
  #error "SPI5 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#endif
#endif

