Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/SPI_STM32F4xx.h
#ifdef MX_SPI6
#if (defined(MX_SPI6_RX_DMA_Instance) || defined(MX_SPI6_TX_DMA_Instance))
#ifndef MX_SPI6_RX_DMA_Instance
  #error "SPI6 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#ifndef MX_SPI6_TX_DMA_Instance
  #error "SPI6 using DMA requires Rx and Tx DMA channel enabled in RTE_Device.h or MX_Device.h!"
#endif
#endif
#endif


#if ((defined(MX_SPI1) && defined(MX_SPI1_RX_DMA_Instance)) || \
     (defined(MX_SPI2) && defined(MX_SPI2_RX_DMA_Instance)) || \
     (defined(MX_SPI3) && defined(MX_SPI3_RX_DMA_Instance)) || \
     (defined(MX_SPI4) && defined(MX_SPI4_RX_DMA_Instance)) || \
     (defined(MX_SPI5) && defined(MX_SPI5_RX_DMA_Instance)) || \
     (defined(MX_SPI6) && defined(MX_SPI6_RX_DMA_Instance)))
#define __SPI_DMA_RX
#endif
#if ((defined(MX_SPI1) && defined(MX_SPI1_TX_DMA_Instance)) || \
     (defined(MX_SPI2) && defined(MX_SPI2_TX_DMA_Instance)) || \
     (defined(MX_SPI3) && defined(MX_SPI3_TX_DMA_Instance)) || \
     (defined(MX_SPI4) && defined(MX_SPI4_TX_DMA_Instance)) || \
     (defined(MX_SPI5) && defined(MX_SPI5_TX_DMA_Instance)) || \
     (defined(MX_SPI6) && defined(MX_SPI6_TX_DMA_Instance)))
#define __SPI_DMA_TX
#endif
#if (defined(__SPI_DMA_RX) && defined(__SPI_DMA_TX))
#define __SPI_DMA
#endif


// Current driver status flag definition
#define SPI_INITIALIZED           ((uint8_t)(1U))           // SPI initialized
#define SPI_POWERED               ((uint8_t)(1U << 1))     // SPI powered on
#define SPI_CONFIGURED            ((uint8_t)(1U << 2))     // SPI configured
#define SPI_DATA_LOST             ((uint8_t)(1U << 3))     // SPI data lost occurred
#define SPI_MODE_FAULT            ((uint8_t)(1U << 4))     // SPI mode fault occurred


// DMA Callback functions
typedef void (*DMA_Callback_t) (DMA_HandleTypeDef *hdma);


// SPI DMA
typedef struct _SPI_DMA {
  DMA_HandleTypeDef    *hdma;           // DMA handle
  DMA_Callback_t        cb_complete;    // DMA complete callback
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  DMA_Stream_TypeDef   *stream;         // Stream register interface
  uint32_t              channel;        // DMA channel
  uint32_t              priority;       // DMA channel priority
  int8_t                irq_num;        // Stream IRQ number
  uint8_t               reserved[3];    // Reserved
#endif
} SPI_DMA;

// SPI pin
typedef const struct _SPI_PIN {
  GPIO_TypeDef         *port;           // Port
  uint32_t              pin;            // Pin
  uint32_t              af;             // Alternate function
  uint8_t               pupd;           // Pull up/down
  uint8_t               speed;          // Speed
  uint16_t              reserved;       // Reserved
} SPI_PIN;

// SPI Input/Output Configuration
typedef const struct _SPI_IO {
  SPI_PIN              *mosi;           // Pointer to MOSI pin configuration
  SPI_PIN              *miso;           // Pointer to MISO pin configuration
  SPI_PIN              *sck;            // Pointer to SCK pin configuration
  SPI_PIN              *nss;            // Pointer to NSS pin configuration
} SPI_IO;

typedef struct _SPI_STATUS {
  uint8_t busy;                         // Transmitter/Receiver busy flag
  uint8_t data_lost;                    // Data lost: Receive overflow / Transmit underflow (cleared on start of transfer operation)
  uint8_t mode_fault;                   // Mode fault detected; optional (cleared on start of transfer operation)
  uint8_t reserved;                     // Reserved
} SPI_STATUS;

// SPI Information (Run-time)
typedef struct _SPI_INFO {
  ARM_SPI_SignalEvent_t cb_event;       // Event Callback
  SPI_STATUS            status;         // Status flags
  uint32_t              state;          // Current SPI state
  uint32_t              mode;           // Current SPI mode
} SPI_INFO;

// SPI Transfer Information (Run-Time)
typedef struct _SPI_TRANSFER_INFO {
  uint32_t              num;            // Total number of transfers
  uint8_t              *rx_buf;         // Pointer to in data buffer
  uint8_t              *tx_buf;         // Pointer to out data buffer
  uint32_t              rx_cnt;         // Number of data received
  uint32_t              tx_cnt;         // Number of data sent
  uint32_t              dump_val;       // Variable for dumping DMA data
  uint16_t              def_val;        // Default transfer value
  uint16_t              reserved;       // Reserved
} SPI_TRANSFER_INFO;


// SPI Resources definition
typedef struct {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  SPI_HandleTypeDef    *h;                    // SPI Handle
#endif
  SPI_TypeDef          *reg;                  // SPI peripheral pointer
  uint32_t            (*periph_clock)(void);  // Peripheral bus clock
  SPI_IO                io;                   // SPI Input/Output pins
  int8_t                irq_num;              // SPI IRQ Number
  uint8_t               reserved[3];          // Reserved
  SPI_DMA              *rx_dma;               // Receive stream register interface
  SPI_DMA              *tx_dma;               // Transmit stream register interface
  SPI_INFO             *info;                 // Run-Time Information
  SPI_TRANSFER_INFO    *xfer;                 // SPI transfer information
} SPI_RESOURCES;

// Global functions and variables exported by driver .c module
#ifdef MX_SPI1
extern void SPI1_IRQHandler     (void);
extern void SPI1_RX_DMA_Handler (void);
extern void SPI1_TX_DMA_Handler (void);

extern ARM_DRIVER_SPI Driver_SPI1;
#endif

#ifdef MX_SPI2
extern void SPI2_IRQHandler     (void);
extern void SPI2_RX_DMA_Handler (void);
extern void SPI2_TX_DMA_Handler (void);

extern ARM_DRIVER_SPI Driver_SPI2;
#endif

#ifdef MX_SPI3
extern void SPI3_IRQHandler     (void);
extern void SPI3_RX_DMA_Handler (void);
extern void SPI3_TX_DMA_Handler (void);

extern ARM_DRIVER_SPI Driver_SPI3;
#endif

#ifdef MX_SPI4
extern void SPI4_IRQHandler     (void);
extern void SPI4_RX_DMA_Handler (void);
extern void SPI4_TX_DMA_Handler (void);

extern ARM_DRIVER_SPI Driver_SPI4;
#endif

#ifdef MX_SPI5
extern void SPI5_IRQHandler     (void);
extern void SPI5_RX_DMA_Handler (void);
extern void SPI5_TX_DMA_Handler (void);

extern ARM_DRIVER_SPI Driver_SPI5;
#endif

#ifdef MX_SPI6
extern void SPI6_IRQHandler     (void);
extern void SPI6_RX_DMA_Handler (void);
extern void SPI6_TX_DMA_Handler (void);

extern ARM_DRIVER_SPI Driver_SPI6;
#endif

#endif /* __SPI_STM32F4XX_H */
